Repository: SondagesPro/limesurvey-oauth2
Catalog: locale/*/*.po
Languages: fr

source: Comma-separated list of scopes to use for authorization.
fr: Liste séparée par des virgules à utiliser pour l'authorisation.

source: User Details URL
fr: URL des détails sur l'utilisateur

source: URL to load the user details from using the retrieved access token.
fr: URL pour obtenir les informations sur l'utilisateur grace au token obtenu précédemment

source: Identifier Attribute
fr: Attribut pour l'identification

source: Attribute of the LimeSurvey user to match against.
fr: Attribut utilisé pour faire correspondre les utilisateurs existants de Limesurvey.

source: Username
fr: Nom de l'utilisateur

source: Key for username in user details
fr: Clé correspondant au nom de l'utilisateur dans les détails sur l'utilisateur

source: Key for the username in the user details data. Only required if used as "Identifier Attibute" or if "Create new users" is enabled.
fr: Clé pour le nom d'utilisateur. Uniquement nécessaire si "Attribut pour l'identification" ou "Créer des nouveaux utilisateurs" est activé

source: Key for e-mail in user details
fr: Clé correspondant à l'email dans les détails sur l'utilisateur

source: Key for the e-mail in the user details data. Only required if used as "Identifier Attibute" or if "Create new users" is enabled.
fr: Clé correspondant à l'email dans les détails sur l'utilisateur. Uniquement nécessaire si "Attribut pour l'identification" ou "Créer des nouveaux utilisateurs" est activé

source: Key for display name in user details
fr: Clé correspondant au nom d'affichage dans les détails sur l'utilisateur

source: Key for the full name in the user details data. Only required if "Create new users" is enabled.
fr: Clé correspondant au nom d'affichage dans les détails sur l'utilisateur. Uniquement nécessaire si "Créer des nouveaux utilisateurs" est activé

source: Use as default login
fr: Utiliser comme authentification par défaut

source: If enabled instead of showing the LimeSurvey login the user is redirected directly to the OAuth2 login. The default login form can always be accessed via:
fr: Si activée, l'utilisateur verra directement le login OAuth en lieu et place de l'authentification classique. L'authentification classique peut être atteinte ici:

source: Create new users
fr: Créer des nouveaux utilisateurs

source: If enabled users that do not exist yet will be created in LimeSurvey after successfull login.
fr: Si activée, les utilisateurs qui n'existent pas seront créés après une authentification réussie.

source: Global roles for new users
fr: Rôles globaux pour les nouveaux utilisateurs

source: Global user roles to be assigned to users that are automatically created.
fr: Rôles globaux pour les utilisateurs automatiquement créés.

source: Global permissions for new users
fr: Permissions globales pour les nouveaux utilisateurs

source: A JSON object describing the default permissions to be assigned to users that are automatically created. The JSON object has the following form: %s
fr: Un objet JSSON décrivant les permissions par défaut assignée aux utilisateurs automatiquement créés. L'objet a la forme suivante: %s

source: Invalid state in OAuth response
fr: État invalide dans la réponse OAuth

source: Failed to retrieve access token
fr: Impossible d'obtenir un token d'accès

source: Failed to retrieve user details
fr: Impossible d'obtenir les détails de l'utilisateur

source: User identifier not found or empty
fr: Les détails de l'utilisateur n'ont pas été trouvés ou sont vides

source: User not found in LimeSurvey
fr: Impossible de trouver l'utilisateur dans LimeSurvey

source: User data is missing required attributes to create new user
fr: Des attributs utilisateurs nécessaires sont manquants

source: Failed to create new user
fr: Impossible de créer un nouvel utilisateur
